In [146]:
import pandas as pd
import numpy as np

# 6.1 Creating Pandas DataFrame with given Structure

In [147]:
arr = [['Sneakers' , 2955 , 6] , ['Bottle' , 1049 , 24] , ['Cricket Bat' , 2400 , 5] , ['Water Purifier' , 7200 , 2] , ['Cooler' , 8560 , 3], ['Backpack', 1343, 9], ['Mattress', 4028 , 4], ['iPhone 16', 79900, 5]]
df = pd.DataFrame(arr , columns = ['Product' , 'Price' , 'Quantity'])
df

          Product  Price  Quantity
0        Sneakers   2955         6
1          Bottle   1049        24
2     Cricket Bat   2400         5
3  Water Purifier   7200         2
4          Cooler   8560         3
5        Backpack   1343         9
6        Mattress   4028         4
7       iPhone 16  79900         5

# 6.2 Adding TotalValue column to the DataFrame

In [148]:
a = np.array(arr)

In [149]:
Total_ = df['Price'] * df['Quantity']
Total = np.array(Total_)
Total_Value = Total.reshape(8,1)

In [150]:
new = np.append(a , Total_Value , axis=1)

In [151]:
df = pd.DataFrame(new , columns = ['Product' , 'Price' , 'Quantity', 'Total Value'])
df

          Product  Price Quantity Total Value
0        Sneakers   2955        6       17730
1          Bottle   1049       24       25176
2     Cricket Bat   2400        5       12000
3  Water Purifier   7200        2       14400
4          Cooler   8560        3       25680
5        Backpack   1343        9       12087
6        Mattress   4028        4       16112
7       iPhone 16  79900        5      399500

# 6.3 Sorting the given DataFrame by TotalValue

In [152]:
df = df.sort_values(by = 'Total Value', ascending = False)

In [153]:
df

          Product  Price Quantity Total Value
7       iPhone 16  79900        5      399500
4          Cooler   8560        3       25680
1          Bottle   1049       24       25176
0        Sneakers   2955        6       17730
6        Mattress   4028        4       16112
3  Water Purifier   7200        2       14400
5        Backpack   1343        9       12087
2     Cricket Bat   2400        5       12000

# Grouping the data by Price and computing the average Quantity for each price group.

In [154]:
df['Price'] = pd.to_numeric(df['Price'])
df['Quantity'] = pd.to_numeric(df['Quantity'])
df['Range'] = pd.cut(df['Price'] , bins= [0,2000,5000,10000,100000])
df

          Product  Price  Quantity Total Value            Range
7       iPhone 16  79900         5      399500  (10000, 100000]
4          Cooler   8560         3       25680    (5000, 10000]
1          Bottle   1049        24       25176        (0, 2000]
0        Sneakers   2955         6       17730     (2000, 5000]
6        Mattress   4028         4       16112     (2000, 5000]
3  Water Purifier   7200         2       14400    (5000, 10000]
5        Backpack   1343         9       12087        (0, 2000]
2     Cricket Bat   2400         5       12000     (2000, 5000]

In [156]:
average_value = df.groupby('Range')['Quantity'].mean()

/var/folders/mt/rpdwshfn4zq0s3rrfk2d1g2m0000gn/T/ipykernel_61382/1567023007.py:1: FutureWarning: The default of observed=False is deprecated and will be changed to True in a future version of pandas. Pass observed=False to retain current behavior or observed=True to adopt the future default and silence this warning.
  average_value = df.groupby('Range')['Quantity'].mean()

In [163]:
print(average_value)

Range
(0, 2000]          16.5
(2000, 5000]        5.0
(5000, 10000]       2.5
(10000, 100000]     5.0
Name: Quantity, dtype: float64